createShipmentOrder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cis="http://dhl.de/webservice/cisbase" xmlns:ns="http://dhl.de/webservices/businesscustomershipping/3.0">
   <soapenv:Header>
      <cis:Authentification>
         <cis:user>{{username}}</cis:user>
         <cis:signature>{{password}}</cis:signature>
      </cis:Authentification>
   </soapenv:Header>
   <soapenv:Body>
      <ns:CreateShipmentOrderRequest>
         <ns:Version>
            <majorRelease>3</majorRelease>
            <minorRelease>0</minorRelease>
            <build>1</build>
         </ns:Version>
         <ShipmentOrder>
            <sequenceNumber>?</sequenceNumber>
            <Shipment>
               <ShipmentDetails>
                  <product>V01PAK</product>
                  <cis:accountNumber>63342653770101</cis:accountNumber>
                  <customerReference/>
                  <shipmentDate>2020-12-01</shipmentDate>
                  <costCentre/>
                  <ShipmentItem>
                     <weightInKG>2</weightInKG>
                     <lengthInCM>50</lengthInCM>
                     <widthInCM>40</widthInCM>
                     <heightInCM>30</heightInCM>
                  </ShipmentItem>
                  <Service>
                  </Service>
                  <Notification>
                     <recipientEmailAddress/>
                  </Notification>
                  </ShipmentDetails>
               <Shipper>
                  <Name>
                     <cis:name1>Junlin Huang</cis:name1>
                  </Name>
                  <Address>
                     <cis:streetName>Nöthnitzerstr.</cis:streetName>
                     <cis:streetNumber>41</cis:streetNumber>
                     <cis:addressAddition/>
                     <cis:dispatchingInformation/>
                     <cis:zip>01187</cis:zip>
                     <cis:city>Dresden</cis:city>
                     <cis:province/>
                     <cis:Origin>
                        <cis:country>Deutschland</cis:country>
                        <cis:countryISOCode>DE</cis:countryISOCode>
                        <cis:state/>
                     </cis:Origin>
                  </Address>
                  <Communication>
                     <cis:phone/>
                     <cis:email>cricketlong@gmail.com</cis:email>
                     <cis:contactPerson/>
                  </Communication>
               </Shipper>
               
               <Receiver>
                  <cis:name1>Peiwen Lin</cis:name1>
                  <Address>
                  <cis:name2>Doval International GmbH</cis:name2>
                  <cis:streetName>Biedermannstr.</cis:streetName>
                     <cis:streetNumber>8</cis:streetNumber>
                     <cis:addressAddition/>
                     <cis:dispatchingInformation/>
                     <cis:zip>01187</cis:zip>
                     <cis:city>Dresden</cis:city>
                     <cis:province/>
                     <cis:Origin>
                        <cis:country>Deutschland</cis:country>
                        <cis:countryISOCode>DE</cis:countryISOCode>
                        <cis:state/>
                     </cis:Origin>
                  </Address>
                  <Communication>
                     <cis:phone/>
                     <cis:email>info@doval-international.de</cis:email>
                     <cis:contactPerson/>
                  </Communication>
               </Receiver>
               </Shipment>
            <PrintOnlyIfCodeable active="1"/>
         </ShipmentOrder>
         <labelResponseType>URL</labelResponseType>
      </ns:CreateShipmentOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>
